       IDENTIFICATION DIVISION.
       PROGRAM-ID.    RPRT.
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
       PROTOCOL.      MODE IS BATCH DEBUG
                      IDMS-RECORDS MANUAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01 EMPLOYEE PIC X.
        01 NAME-INDEX PIC x.
       PROCEDURE DIVISION.
           OBTAIN FIRST EMPLOYEE WITHIN NAME-INDEX.
           OBTAIN FIRST EMPLOYEE 
           EXIT.