       IDENTIFICATION DIVISION.
       PROGRAM-ID.    RPRT.
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
       PROTOCOL.      MODE IS BATCH DEBUG
                      IDMS-RECORDS MANUAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
        01 ABC PIC X.
        01 XYZ PIC x.
       PROCEDURE DIVISION.
           DISCONNECT ABC FROM XYZ.
           DISCONNECT ABC
           EXIT.